Revit 2024 API
FileImportingEventArgs Class
 The event arguments used by the FileImporting event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public class FileImportingEventArgs : RevitAPIPreDocEventArgs
Visual Basic
Public Class FileImportingEventArgs _
	Inherits RevitAPIPreDocEventArgs
Visual C++
public ref class FileImportingEventArgs : public RevitAPIPreDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.FileImportingEventArgs
See Also
FileImportingEventArgs Members
Autodesk.Revit.DB.Events Namespace